---
title: "Практическое руководство. Добавление к числу начальных нулей. | Microsoft Docs"
ms.custom: ""
ms.date: "03/30/2017"
ms.prod: ".net"
ms.reviewer: ""
ms.suite: ""
ms.technology: 
  - "dotnet-standard"
ms.tgt_pltfrm: ""
ms.topic: "article"
helpviewer_keywords: 
  - "форматирование [платформа .NET Framework], числа"
  - "форматирование чисел [платформа .NET Framework]"
  - "числа [платформа .NET Framework], строки формата"
  - "строки числовых форматов [платформа .NET Framework]"
ms.assetid: 0b2c2cb5-c580-4891-8d81-cb632f5ec384
caps.latest.revision: 10
author: "rpetrusha"
ms.author: "ronpet"
manager: "wpickett"
caps.handback.revision: 10
---
# Практическое руководство. Добавление к числу начальных нулей.
Вы можете добавить начальные нули в целое число, используя [строку стандартного числового формата](../../../docs/standard/base-types/standard-numeric-format-strings.md) "D" с описателем точности.  Начальные нули можно добавить в целые числа и числа с плавающей запятой, используя [строку настраиваемого числового формата](../../../docs/standard/base-types/custom-numeric-format-strings.md).  В этой статье показано, как использовать оба метода для дополнения числа начальными нулями.  
  
### Дополнение целого числа начальными нулями до определенной длины  
  
1.  Определите минимальное число разрядов для целого числа.  Добавьте к этому значению число начальных разрядов.  
  
2.  Определите, хотите ли вы показывать целое число как десятичное или шестнадцатеричное.  
  
    -   Чтобы показать целое число как десятичное, вызовите метод `ToString(String)` и передайте строку "D*n*" в параметре `format`, где *n* представляет минимальную длину строки.  
  
    -   Чтобы показать целое число как шестнадцатеричное, вызовите метод `ToString(String)` и передайте строку "X*n*" в параметре `format`, где *n* представляет минимальную длину строки.  
  
     Вы также можете использовать строку формата в методе, например <xref:System.String.Format%2A> или <xref:System.Console.WriteLine%2A>, который использует [составное форматирование](../../../docs/standard/base-types/composite-formatting.md).  
  
 Следующий пример форматирует несколько целых значений с добавлением начальных нулей, чтобы общая длина форматированного числа составляла по крайней мере 8 символов.  
  
 [!code-csharp[Formatting.HowTo.PadNumber#1](../../../samples/snippets/csharp/VS_Snippets_CLR/Formatting.HowTo.PadNumber/cs/Pad1.cs#1)]
 [!code-vb[Formatting.HowTo.PadNumber#1](../../../samples/snippets/visualbasic/VS_Snippets_CLR/Formatting.HowTo.PadNumber/vb/Pad1.vb#1)]  
  
### Дополнение целого числа определенным количеством начальных нулей  
  
1.  Определите, сколько начальных нулей должно быть в целом числе.  
  
2.  Определите, хотите ли вы показывать целое число как десятичное или шестнадцатеричное.  Чтобы отформатировать число как десятичное значение, необходимо использовать стандартный описатель формата "D", чтобы отформатировать число как шестнадцатеричное значение, используйте стандартный описатель формата "X".  
  
3.  Определите длину недополненной числовой строки, вызвав метод `ToString("D").Length` или `ToString("X").Length` целого числа.  
  
4.  Добавьте число начальных нулей, которое следует добавить в форматированную строку, к длине недополненной числовой строки.  Будет получена общая длина результирующей строки.  
  
5.  Вызовите метод `ToString(String)` целого числа и передайте строку "D*n*" для десятичных строк или строку "X*n*" для шестнадцатеричных строк, где *n* — это общая длина результирующей строки.  Вы также можете использовать строку формата "D*n*" или "X*n*" в методе, который использует поддерживает составное форматирование.  
  
 Следующий пример дополняет целое число пятью начальными нулями.  
  
 [!code-csharp[Formatting.HowTo.PadNumber#2](../../../samples/snippets/csharp/VS_Snippets_CLR/Formatting.HowTo.PadNumber/cs/Pad1.cs#2)]
 [!code-vb[Formatting.HowTo.PadNumber#2](../../../samples/snippets/visualbasic/VS_Snippets_CLR/Formatting.HowTo.PadNumber/vb/Pad1.vb#2)]  
  
### Дополнение числового значения начальными нулями до определенной длины  
  
1.  Определите, сколько разрядов слева от десятичного разделителя должно быть в строковом представлении числа.  Добавьте к этому значению число начальных нулей.  
  
2.  Определите строку настраиваемого формата числа, использующую местозаполнитель нуля \("0"\) для представления минимального количества нулей.  
  
3.  Вызовите метод `ToString(String)` числа и передайте ему строку настраиваемого формата.  Вы также можете использовать строку настраиваемого формата с методом, поддерживающим составное форматирование.  
  
 Следующий пример форматирует несколько числовых значений с добавлением начальных нулей, чтобы общая длина форматированного числа составляла по крайней мере 8 символов слева от десятичного разделителя.  
  
 [!code-csharp[Formatting.HowTo.PadNumber#3](../../../samples/snippets/csharp/VS_Snippets_CLR/Formatting.HowTo.PadNumber/cs/Pad1.cs#3)]
 [!code-vb[Formatting.HowTo.PadNumber#3](../../../samples/snippets/visualbasic/VS_Snippets_CLR/Formatting.HowTo.PadNumber/vb/Pad1.vb#3)]  
  
### Дополнение числового значения определенным количеством начальных нулей  
  
1.  Определите, сколько начальных нулей должно быть в числовом значении.  
  
2.  Определите количество разрядов слева от десятичного разделителя в недополненной числовой строке.  Для этого:  
  
    1.  Определите, содержит ли строковое представление числа символ десятичной точки.  
  
    2.  Если это так, определите число символов слева от десятичной точки.  
  
         \-или\-  
  
         Если строка не содержит десятичную точку, определите длину строки.  
  
3.  Создайте строку настраиваемого формата, использующую нулевой местозаполнитель \("0"\) для каждого начального нуля, которые будут добавлены в строку, и использующую нулевой местозаполнитель или местозаполнитель разряда \("\#"\) для представления каждого разряда в строке по умолчанию.  
  
4.  Передайте строку настраиваемого формата как параметр методу `ToString(String)` числа или методу, поддерживающему составное форматирование.  
  
 Следующий пример дополняет два значения типа <xref:System.Double> число пятью начальными нулями.  
  
 [!code-csharp[Formatting.HowTo.PadNumber#4](../../../samples/snippets/csharp/VS_Snippets_CLR/Formatting.HowTo.PadNumber/cs/Pad1.cs#4)]
 [!code-vb[Formatting.HowTo.PadNumber#4](../../../samples/snippets/visualbasic/VS_Snippets_CLR/Formatting.HowTo.PadNumber/vb/Pad1.vb#4)]  
  
## См. также  
 [Строки настраиваемых числовых форматов](../../../docs/standard/base-types/custom-numeric-format-strings.md)   
 [Строки стандартных числовых форматов](../../../docs/standard/base-types/standard-numeric-format-strings.md)   
 [Составное форматирование](../../../docs/standard/base-types/composite-formatting.md)